<a href="https://colab.research.google.com/github/santhoshBjeeffy/Pandas/blob/master/create_Series_dataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
#create a directory

raw_data={"name":["santhosh","manoj","shivakumar","chethan"],
         "evolution":["Dbpur","marsandra","hebbal","kodigehalli"],
         "type":["grass","fire","water","bug"],
         "hp":[12,31,43,21],
         "pokedex":["yes","no","yes","no"]
         }

In [3]:
pokeman=pd.DataFrame(raw_data)
pokeman.head()

         name    evolution   type  hp pokedex
0    santhosh        Dbpur  grass  12     yes
1       manoj    marsandra   fire  31      no
2  shivakumar       hebbal  water  43     yes
3     chethan  kodigehalli    bug  21      no

#Ops...it seems the DataFrame columns are in alphabetical order. Place the order of the columns as name, type, hp, evolution, pokedex

In [4]:
pokeman=pokeman[["name","evolution","hp","pokedex","type"]]
pokeman.head()

         name    evolution  hp pokedex   type
0    santhosh        Dbpur  12     yes  grass
1       manoj    marsandra  31      no   fire
2  shivakumar       hebbal  43     yes  water
3     chethan  kodigehalli  21      no    bug

#insert another column place in a dataframe

In [8]:
pokeman['place']=['whitefield','whitefield','hebbal','hebbal']
pokeman.head()

         name    evolution  hp pokedex   type       place
0    santhosh        Dbpur  12     yes  grass  whitefield
1       manoj    marsandra  31      no   fire  whitefield
2  shivakumar       hebbal  43     yes  water      hebbal
3     chethan  kodigehalli  21      no    bug      hebbal

In [12]:
#type each columns
pokeman.dtypes #pokeman.columns

name         object
evolution    object
hp            int64
pokedex      object
type         object
place        object
dtype: object